## Лабораторная работа №4

# 1. Реализовать последовательность {𝐵𝑛} для заданного значения ставки 
# r = 0.01, используя формулу (5), за период 𝑁 = 200 при 𝐵0 = 1. 
# Построить график.

N = 200
B = array(dim=N)
B[1] = 1
r = 0.01

for(i in 2:N)
  B[i] = (1+r)*B[i-1]
plot(B,type='l')

# 2. Реализовать случайный процесс {𝑆𝑛}, используя формулу (5), 
# при следующих значениях параметров: 𝑆0 = 1, 𝑁 = 200, 𝑎 = −0.3, 𝑏 = 0.8, 𝑝 = 0.4.
# Построить график.

S = array(dim=N)
a = -0.3; b = 0.8; p = 0.4
S[1] = 1

ro = rbinom(N,1,p)
for(i in 1:N) {
  if(ro[i]) ro[i] = b
  else ro[i] = a
}

for(i in 2:N)
  S[i] = (1+ro[i])*S[i-1]
plot(S,type='l')

# 3. Рассчитать справедливую цену call-опциона по формуле (7) при 
# следующих значениях параметров: 𝑆0 = 100, 𝑁 = 10, 𝑎 = −0.3, 𝑏 = 0.8, 𝑟 = 0.2, 𝐾 = 100.
N1 = 10; r1 = 0.2; K = 100

S0 = 100
p_w = (r1-a)/(b-a)
p_o = (1+b)*p_w/(1+r1)

K0 = 1+log(K/(S0*(1+a)^N1))%/%log((1+b)/(1+a))   # < N1

B = function(j,N,p) {
  sum = 0
  for(k in j:N)
    sum = sum + choose(N,k)*p^k*(1-p)^(N-k)
  return(sum)
}

CN = S0*B(K0,N1,p_o)-K*(1+r1)^(-N)*B(K0,N,p_w)
CN
