## Лабораторная работа №5

# 2. Замоделировать процесс (8) для ∆ = 0.0001 ( т.е. средне-квадратическое
# отклонение с.в. 𝜀𝑘∆ равно √ ∆ = 0.01) и 𝑘 = 0,1,...,10^3

d = 0.0001
i = 0:1000
kd = d*i

B = array(dim=1001)
B[1] = 0

for(i in 2:1001)
  B[i] = B[i-1] + rnorm(1,0,0.01) 
plot(kd,B,type='l')

# 3. Построить ансамбль реализаций процесса, замоделированного на предыдущем шаге, 
# и вывести все реализации процесса на один график. 
# Т.е. построить 200 реализаций процесса (8) на одном графике.

plot(kd,B,type='l',ylim = c(-1,1))

j = 0
repeat {
  for(i in 2:1001)
    B[i] = B[i-1] + rnorm(1,0,0.01) 
  lines(kd,B,type='l')
  j = j + 1
  if(j == 199) break
}

# 4. Ограничить ансамбль реализаций, построенный на предыдущем шаге по правилу трех сигм.

high = 3*sqrt(kd)
low = -high
lines(kd,high,type='l',col='blue')
lines(kd,low,type='l',col='blue')

# 5. Реализовать процесс (9) при следующих входных значениях параметров:
# 𝑆0 = 1, 𝑎 = 0.5, 𝜎 = 0.9,
# √ ∆ = 0.01, 𝑘 = 0,1,...,103.

S = array(dim=1001)
S[1] = 1; a = 0.5; sig = 0.9

# d = 0.0001
# i = 0:1000
# kd = d*i
B = array(dim=1001)
B[1] = 0

for(i in 2:1001) {
  B[i] = B[i-1] + rnorm(1,0,0.01) 
  S[i] = S[1]*exp((a-sig^2/2)*(i)*d+sig*B[i])
}
plot(kd,S,type='l')

# 6. Построить 200 реализаций процесса (10) на одном графике.   
plot(kd,S,type='l',ylim=c(0,3))

j = 0 
repeat {
  for(i in 2:1001) {
    B[i] = B[i-1] + rnorm(1,0,0.01) 
    S[i] = S[1]*exp((a-sig^2/2)*(i)*d+sig*B[i])
  } 
  lines(kd,S,type='l')
  j = j + 1
  if(j == 199) break
}            

